Repository: LAPTop4iK/Timetable-DSW
Catalog: Timetable DSW/Resources/Localizable.xcstrings
Source language: pl
Languages: en, uk

# teachers.search
source: Szukaj wykładowców
en: Search lecturers
uk: Пошук викладачів

# teachers.title
source: Wykładowcy
en: Lecturers
uk: Викладачі

# theme.name.cherry
source: Kwiat wiśni
en: Cherry Blossom
uk: Вишневий цвіт

# theme.name.default
source: Domyślny
en: Default
uk: Стандартна

# theme.name.forest
source: Leśny
en: Forest
uk: Ліс

# theme.name.lavender
source: Lawenda
en: Lavender
uk: Лаванда

# theme.name.midnight
source: Północ
en: Midnight
uk: Опівніч

# theme.name.monochrome
source: Monochromatyczny
en: Monochrome
uk: Монохром

# theme.name.ocean
source: Oceaniczny
en: Ocean
uk: Океан

# theme.name.sunset
source: Zachód słońca
en: Sunset
uk: Захід сонця

# themeSettings.appearance.title
source: Wygląd
en: Appearance
uk: Зовнішній вигляд

# themeSettings.colorTheme.title
source: Motyw kolorów
en: Color Theme
uk: Кольорова тема

# themeSettings.title
source: Ustawienia motywu
en: Theme Settings
uk: Налаштування теми

# widget.access
source: Twoje widżety mają dostęp do danych twojego harmonogramu
en: Your widgets have access to your schedule data
uk: Ваші віджети мають доступ до даних вашого розкладу

# widget.available
source: Dostępne widżety
en: Available Widgets
uk: Доступні віджети

# widget.common.classes
source: zajęcia
en: classes
uk: занять

# widget.common.enjoyFreeDay
source: Miłego dnia!
en: Enjoy your day!
uk: Гарного дня!

# widget.common.moreSuffix
source: więcej
en: more
uk: ще

# widget.common.next
source: NAST.
en: NEXT
uk: ДАЛІ

# widget.common.noClasses
source: Brak zajęć
en: No classes
uk: Нема занять

# widget.common.noClassesToday
source: Dziś brak zajęć
en: No classes today
uk: Сьогодні без занять

# widget.common.now
source: TERAZ
en: NOW
uk: ЗАРАЗ

# widget.common.thisWeek
source: Ten tydzień
en: This week
uk: Цього тижня

# widget.common.today
source: Dziś
en: Today
uk: Сьогодні

# widget.common.until
source: Do
en: Until
uk: До

# widget.common.week
source: Tydz.
en: Week
uk: Тиж.

# widget.config.description
source: Opcje widoku widżetu
en: Widget display options
uk: Параметри вигляду віджета

# widget.config.showOnlineStatus.title
source: Pokaż online
en: Show online
uk: Показувати онлайн

# widget.config.title
source: Ustawienia widżetu
en: Widget settings
uk: Налаштування віджета

# widget.config.viewType.title
source: Widok
en: View
uk: Вигляд

# widget.config.viewType.today
source: Dziś
en: Today
uk: Сьогодні

# widget.config.viewType.week
source: Tydzień
en: Week
uk: Тиждень

# widget.configure
source: Skonfiguruj widżety ekranu głównego
en: Configure home screen widgets
uk: Налаштуйте віджети головного екрана

# widget.control.openSchedule.description
source: Szybkie otwarcie planu
en: Open timetable fast
uk: Швидке відкриття розкладу

# widget.control.openSchedule.displayName
source: Szybki plan
en: Quick Schedule
uk: Швидкий розклад

# widget.control.openSchedule.label
source: Plan
en: Schedule
uk: Розклад

# widget.control.toggle.description
source: Pokazuje, czy dziś są zajęcia
en: Shows if you have classes today
uk: Показує, чи є заняття сьогодні

# widget.control.toggle.displayName
source: Status zajęć
en: Classes Status
uk: Статус занять

# widget.control.toggle.label
source: Zajęcia dziś
en: Classes today
uk: Заняття сьогодні

# widget.description.timetable
source: Twój plan w skrócie
en: Your schedule at a glance
uk: Розклад одним поглядом

# widget.enabled
source: Widżety włączone
en: Widgets Enabled
uk: Віджети увімкнено

# widget.enabled.title
source: Widżety włączone
en: Widgets Enabled
uk: Віджети увімкнено

# widget.footer.reloadHint
source: Jeśli coś wygląda niepoprawnie, spróbuj odświeżyć widżety.
en: If something looks off, try reloading widgets.
uk: Якщо щось відображається некоректно, спробуйте оновити віджети.

# widget.home.subtitle
source: Skonfiguruj sposób wyświetlania harmonogramu w widżetach
en: Configure how widgets display your schedule

# widget.home.title
source: Widżety ekranu głównego
en: Home screen widgets
uk: Віджети головного екрана

# widget.how.to.add
source: Jak dodać widżet
en: How to Add Widget
uk: Як додати віджет

# widget.instruction.step1
source: Przytrzymaj długo na ekranie głównym
en: Long press on your home screen
uk: Довго натисніть на головному екрані

# widget.instruction.step2
source: Stuknij przycisk "+" w lewym górnym rogu
en: Tap the "+" button in the top-left
uk: Натисніть кнопку "+" у верхньому лівому куті

# widget.instruction.step3
source: Wyszukaj "Timetable"
en: Search for "Timetable"
uk: Знайдіть "Timetable"

# widget.instruction.step4
source: Wybierz rozmiar widżetu i dodaj
en: Choose widget size and add
uk: Виберіть розмір віджета і додайте

# widget.intent.configuration.title
source: Konfiguracja
en: Configuration
uk: Налаштування

# widget.intent.nextClass.description
source: Pokaż następne zajęcia
en: Show next class
uk: Показати наступне заняття

# widget.intent.nextClass.title
source: Następne zajęcia
en: Next class
uk: Наступне заняття

# widget.intent.openTimetable.description
source: Otwiera aplikację
en: Opens the app
uk: Відкриває застосунок

# widget.intent.openTimetable.title
source: Otwórz plan
en: Open timetable
uk: Відкрити розклад

# widget.intent.refreshSchedule.parameter.enabled
source: Włączone
en: Enabled
uk: Увімкнено

# widget.intent.refreshSchedule.title
source: Odśwież plan
en: Refresh schedule
uk: Оновити розклад

# widget.intent.todaySchedule.description
source: Pokaż dzisiejsze zajęcia
en: Show today's classes
uk: Показати сьогоднішні заняття

# widget.intent.todaySchedule.title
source: Dzisiejszy plan
en: Today’s schedule
uk: Сьогоднішній розклад

# widget.live.ends
source: Koniec
en: Ends
uk: Кінець

# widget.live.percentCompleteSuffix
source: ukończone
en: complete
uk: завершено

# widget.name.timetable
source: Plan zajęć
en: Timetable
uk: Розклад

# widget.never.updated
source: Nigdy nieaktualizowane
en: Never updated
uk: Ніколи не оновлювалися

# widget.settings.subtitle
source: Skonfiguruj widżety ekranu głównego
en: Configure home screen widgets
uk: Налаштуйте віджети головного екрана

# widget.settings.title
source: Ustawienia widżetów
en: Widget Settings
uk: Налаштування віджетів

# widget.status.active
source: Aktywne
en: Active
uk: Активно

# widget.status.noClasses
source: Brak zajęć
en: No classes
uk: Нема занять

# widget.title
source: Widżety
en: Widgets
uk: Віджети

# widget.troubleshoot.noData.solution
source: Otwórz aplikację przynajmniej raz, aby wczytać plan
en: Open the app at least once to load your schedule
uk: Відкрийте додаток хоча б один раз, щоб завантажити розклад

# widget.troubleshoot.noData.title
source: Widżet pokazuje "Brak danych"
en: Widget shows "No Data"
uk: Віджет показує "Немає даних"

# widget.troubleshoot.notUpdating.solution
source: Stuknij przycisk odświeżania powyżej, aby zaktualizować ręcznie
en: Tap the refresh button above to manually update
uk: Натисніть кнопку оновлення вище, щоб оновити вручну

# widget.troubleshoot.notUpdating.title
source: Widżet się nie aktualizuje
en: Widget not updating
uk: Віджет не оновлюється

# widget.troubleshoot.wrongTheme.solution
source: Zmień motyw w aplikacji, widżety zaktualizują się automatycznie
en: Change theme in app, widgets will update automatically
uk: Змініть тему в додатку, віджети оновляться автоматично

# widget.troubleshoot.wrongTheme.title
source: Nieprawidłowe kolory motywu
en: Wrong theme colors
uk: Неправильні кольори теми

# widget.troubleshooting
source: Rozwiązywanie problemów
en: Troubleshooting

# widget.type.large.description
source: Przegląd planu tygodniowego
en: Weekly schedule overview
uk: Огляд розкладу на тиждень

# widget.type.large.title
source: Duży widżet
en: Large Widget
uk: Великий віджет

# widget.type.live.description
source: Śledzenie zajęć w czasie rzeczywistym (Dynamic Island)
en: Real-time class tracking (Dynamic Island)
uk: Відстеження занять у реальному часі (Dynamic Island)

# widget.type.medium.description
source: Dzisiejszy plan (do 3 zajęć)
en: Today's schedule (up to 3 classes)
uk: Сьогоднішній розклад (до 3 занять)

# widget.type.medium.title
source: Średni widżet
en: Medium Widget
uk: Середній віджет

# widget.type.small.description
source: Pokazuje bieżące lub następne zajęcia
en: Shows current or next class
uk: Показує поточне або наступне заняття

# widget.type.small.title
source: Mały widżet
en: Small Widget
uk: Малий віджет

# debug.ok
source: OK
uk: ОК

# debug.premiumLabel
source: Premium
uk: Преміум

# debug.status
source: Status
uk: Статус

# general.offline
source: Offline
uk: Офлайн

# general.online
source: Online
uk: Онлайн

# widget.status.title
source: Status
uk: Статус
